import { defineStore } from 'pinia'
import axios from 'axios'
export const useMapStore = defineStore('map', () => {
  const centers = [
    {
        'position': '서울특별시',
        'lat': 37.5665851,
        'lng': 126.9782038,
        'level': 7,
        'positionDetail': [
            {
                'name': '종로구',
                'lat': 37.573050,
                'lng': 126.979189,
                'level': 4
            },
            {
                'name': '중구',
                'lat': 37.563760,
                'lng': 126.997600,
                'level': 4
            },
            {
                'name': '용산구',
                'lat': 37.532600,
                'lng': 126.990500,
                'level': 4
            },
            {
                'name': '성동구',
                'lat': 37.563300,
                'lng': 127.036400,
                'level': 4
            },
            {
                'name': '광진구',
                'lat': 37.538700,
                'lng': 127.082300,
                'level': 4
            },
            {
                'name': '동대문구',
                'lat': 37.574300,
                'lng': 127.039600,
                'level': 4
            },
            {
                'name': '중랑구',
                'lat': 37.606300,
                'lng': 127.092800,
                'level': 4
            },
            {
                'name': '성북구',
                'lat': 37.589400,
                'lng': 127.016700,
                'level': 4
            },
            {
                'name': '강북구',
                'lat': 37.639800,
                'lng': 127.025500,
                'level': 4
            },
            {
                'name': '도봉구',
                'lat': 37.668800,
                'lng': 127.047400,
                'level': 4
            },
            {
                'name': '노원구',
                'lat': 37.654300,
                'lng': 127.056800,
                'level': 4
            },
            {
                'name': '은평구',
                'lat': 37.617600,
                'lng': 126.922700,
                'level': 4
            },
            {
                'name': '서대문구',
                'lat': 37.579200,
                'lng': 126.936800,
                'level': 4
            },
            {
                'name': '마포구',
                'lat': 37.566300,
                'lng': 126.901600,
                'level': 4
            },
            {
                'name': '양천구',
                'lat': 37.527100,
                'lng': 126.856300,
                'level': 4
            },
            {
                'name': '강서구',
                'lat': 37.550900,
                'lng': 126.849500,
                'level': 4
            },
            {
                'name': '구로구',
                'lat': 37.495500,
                'lng': 126.887400,
                'level': 4
            },
            {
                'name': '금천구',
                'lat': 37.460400,
                'lng': 126.900200,
                'level': 4
            },
            {
                'name': '영등포구',
                'lat': 37.526000,
                'lng': 126.896100,
                'level': 4
            },
            {
                'name': '동작구',
                'lat': 37.512400,
                'lng': 126.939900,
                'level': 4
            },
            {
                'name': '관악구',
                'lat': 37.478400,
                'lng': 126.951600,
                'level': 4
            },
            {
                'name': '서초구',
                'lat': 37.483600,
                'lng': 127.032400,
                'level': 4
            },
            {
                'name': '강남구',
                'lat': 37.517200,
                'lng': 127.047300,
                'level': 4
            },
            {
                'name': '송파구',
                'lat': 37.514600,
                'lng': 127.105600,
                'level': 4
            },
            {
                'name': '강동구',
                'lat': 37.530100,
                'lng': 127.123800,
                'level': 4
            }
        ]
    },
    {
        'position': '대전광역시',
        'lat': 36.3504119,
        'lng': 127.3845475,
        'level': 7,
        'positionDetail': [
            {
                'name': '동구',
                'lat': 36.335139,
                'lng': 127.454286,
                'level': 4
            },
            {
                'name': '중구',
                'lat': 36.325491,
                'lng': 127.418079,
                'level': 4
            },
            {
                'name': '서구',
                'lat': 36.357192,
                'lng': 127.384740,
                'level': 4
            },
            {
                'name': '유성구',
                'lat': 36.362236,
                'lng': 127.356508,
                'level': 4
            },
            {
                'name': '대덕구',
                'lat': 36.346530,
                'lng': 127.414195,
                'level': 4
            }
          ]
    },
    {
        'position': '광주광역시',
        'lat': 35.1595454,
        'lng': 126.8526012,
        'level': 7,
        'positionDetail': [
            {
                'name': '동구',
                'lat': 35.144300,
                'lng': 126.923700,
                'level': 4
            },
            {
                'name': '서구',
                'lat': 35.152600,
                'lng': 126.890200,
                'level': 4
            },
            {
                'name': '남구',
                'lat': 35.133400,
                'lng': 126.902000,
                'level': 4
            },
            {
                'name': '북구',
                'lat': 35.174900,
                'lng': 126.911300,
                'level': 4
            },
            {
                'name': '광산구',
                'lat': 35.139200,
                'lng': 126.791000,
                'level': 4
            }
        ]
    },
    {
        'position': '부산광역시',
        'lat': 35.1795543,
        'lng': 129.0756416,
        'level': 7,
        'positionDetail': [
            {
                'name': '중구',
                'lat': 35.106609,
                'lng': 129.030064,
                'level': 4
            },
            {
                'name': '서구',
                'lat': 35.099923,
                'lng': 129.018324,
                'level': 4
            },
            {
                'name': '동구',
                'lat': 35.129404,
                'lng': 129.043314,
                'level': 4
            },
            {
                'name': '영도구',
                'lat': 35.091212,
                'lng': 129.065700,
                'level': 4
            },
            {
                'name': '부산진구',
                'lat': 35.163087,
                'lng': 129.051213,
                'level': 4
            },
            {
                'name': '동래구',
                'lat': 35.204049,
                'lng': 129.083673,
                'level': 4
            },
            {
                'name': '남구',
                'lat': 35.132778,
                'lng': 129.091863,
                'level': 4
            },
            {
                'name': '북구',
                'lat': 35.198325,
                'lng': 129.004005,
                'level': 4
            },
            {
                'name': '해운대구',
                'lat': 35.163131,
                'lng': 129.163658,
                'level': 4
            },
            {
                'name': '사하구',
                'lat': 35.105380,
                'lng': 128.972650,
                'level': 4
            },
            {
                'name': '금정구',
                'lat': 35.254097,
                'lng': 129.091257,
                'level': 4
            },
            {
                'name': '강서구',
                'lat': 35.209087,
                'lng': 128.978399,
                'level': 4
            },
            {
                'name': '연제구',
                'lat': 35.177876,
                'lng': 129.084584,
                'level': 4
            },
            {
                'name': '수영구',
                'lat': 35.156848,
                'lng': 129.115017,
                'level': 4
            },
            {
                'name': '사상구',
                'lat': 35.152640,
                'lng': 128.988623,
                'level': 4
            },
            {
                'name': '기장군',
                'lat': 35.320926,
                'lng': 129.210938,
                'level': 4
            }
        ]
    },
    {
        'position': '대구광역시',
        'lat': 35.8714354,
        'lng': 128.601445,
        'level': 7,
        'positionDetail': [
            {
                'name': '중구',
                'lat': 35.869333,
                'lng': 128.606205,
                'level': 4
            },
            {
                'name': '동구',
                'lat': 35.876249,
                'lng': 128.624180,
                'level': 4
            },
            {
                'name': '서구',
                'lat': 35.870249,
                'lng': 128.556135,
                'level': 4
            },
            {
                'name': '남구',
                'lat': 35.840718,
                'lng': 128.581457,
                'level': 4
            },
            {
                'name': '북구',
                'lat': 35.885286,
                'lng': 128.586712,
                'level': 4
            },
            {
                'name': '수성구',
                'lat': 35.859377,
                'lng': 128.623175,
                'level': 4
            },
            {
                'name': '달서구',
                'lat': 35.822887,
                'lng': 128.528999,
                'level': 4
            },
            {
                'name': '달성군',
                'lat': 35.705168,
                'lng': 128.468482,
                'level': 4
            }
        ]
    },
    {
        'position': '인천광역시',
        'lat': 37.4562565,
        'lng': 126.7052061,
        'level': 7,
        'positionDetail': [
            {
                'name': '중구',
                'lat': 37.4562565,
                'lng': 126.7052061,
                'level': 4
            },
            {
                'name': '동구',
                'lat': 37.4787686,
                'lng': 126.6425358,
                'level': 4
            },
            {
                'name': '미추홀구',
                'lat': 37.448127,
                'lng': 126.678739,
                'level': 4
            },
            {
                'name': '연수구',
                'lat': 37.4178046,
                'lng': 126.6802042,
                'level': 4
            },
            {
                'name': '남동구',
                'lat': 37.4488897,
                'lng': 126.7348245,
                'level': 4
            },
            {
                'name': '부평구',
                'lat': 37.5086022,
                'lng': 126.7192934,
                'level': 4
            },
            {
                'name': '계양구',
                'lat': 37.542873,
                'lng': 126.736674,
                'level': 4
            },
            {
                'name': '서구',
                'lat': 37.5461036,
                'lng': 126.6247416,
                'level': 4
            }
        ]
    },
    
    {
        'position': '강원도',
        'lat': 37.8853694,
        'lng': 127.7298296,
        'level': 7,
        'positionDetail': [
            {
                'name': '춘천시',
                'lat': 37.8782804,
                'lng': 127.7376774,
                'level': 4
            },
            {
                'name': '원주시',
                'lat': 37.3444396,
                'lng': 127.9498583,
                'level': 4
            },
            {
                'name': '강릉시',
                'lat': 37.751853,
                'lng': 128.8760576,
                'level': 4
            },
            {
                'name': '동해시',
                'lat': 37.521693,
                'lng': 129.116478,
                'level': 4
            },
            {
                'name': '태백시',
                'lat': 37.1671978,
                'lng': 128.9875477,
                'level': 4
            },
            {
                'name': '속초시',
                'lat': 38.2030153,
                'lng': 128.5880165,
                'level': 4
            },
            {
                'name': '삼척시',
                'lat': 37.4447041,
                'lng': 129.168257,
                'level': 4
            },
            {
                'name': '홍천군',
                'lat': 37.7067905,
                'lng': 127.8886639,
                'level': 4
            },
            {
                'name': '횡성군',
                'lat': 37.4931941,
                'lng': 127.9988114,
                'level': 4
            },
            {
                'name': '영월군',
                'lat': 37.1811341,
                'lng': 128.4679468,
                'level': 4
            },
            {
                'name': '평창군',
                'lat': 37.3706293,
                'lng': 128.3899768,
                'level': 4
            },
            {
                'name': '정선군',
                'lat': 37.3810562,
                'lng': 128.6607678,
                'level': 4
            },
            {
                'name': '철원군',
                'lat': 38.1461027,
                'lng': 127.3031578,
                'level': 4
            },
            {
                'name': '화천군',
                'lat': 38.1058919,
                'lng': 127.701259,
                'level': 4
            },
            {
                'name': '양구군',
                'lat': 38.1052103,
                'lng': 127.9893635,
                'level': 4
            },
            {
                'name': '인제군',
                'lat': 38.0667735,
                'lng': 128.1687962,
                'level': 4
            },
            {
                'name': '고성군',
                'lat': 38.3776449,
                'lng': 128.4677149,
                'level': 4
            },
            {
                'name': '양양군',
                'lat': 38.106154,
                'lng': 128.6123164,
                'level': 4
            }
        ]
    },
    {
        'position': '충청남도',
        'lat': 36.6584026,
        'lng': 126.6724161,
        'level': 7,
        'positionDetail': [
            {
                'name': '천안시',
                'lat': 36.8191269,
                'lng': 127.1138015,
                'level': 4
            },
            {
                'name': '공주시',
                'lat': 36.4445623,
                'lng': 127.1242965,
                'level': 4
            },
            {
                'name': '보령시',
                'lat': 36.331048,
                'lng': 126.6016125,
                'level': 4
            },
            {
                'name': '아산시',
                'lat': 36.7925013,
                'lng': 127.003177,
                'level': 4
            },
            {
                'name': '서산시',
                'lat': 36.780557,
                'lng': 126.4509551,
                'level': 4
            },
            {
                'name': '논산시',
                'lat': 36.2067455,
                'lng': 127.0953375,
                'level': 4
            },
            {
                'name': '계룡시',
                'lat': 36.2675943,
                'lng': 127.2413497,
                'level': 4
            },
            {
                'name': '당진시',
                'lat': 36.8933098,
                'lng': 126.6462246,
                'level': 4
            },
            {
                'name': '금산군',
                'lat': 36.1084577,
                'lng': 127.4803045,
                'level': 4
            },
            {
                'name': '부여군',
                'lat': 36.2800735,
                'lng': 126.9057229,
                'level': 4
            },
            {
                'name': '서천군',
                'lat': 36.0819027,
                'lng': 126.6886217,
                'level': 4
            },
            {
                'name': '청양군',
                'lat': 36.4568599,
                'lng': 126.795722,
                'level': 4
            },
            {
                'name': '홍성군',
                'lat': 36.5973887,
                'lng': 126.6630987,
                'level': 4
            },
            {
                'name': '예산군',
                'lat': 36.678832,
                'lng': 126.831421,
                'level': 4
            },
            {
                'name': '탕정군',
                'lat': 36.7411227,
                'lng': 126.6390751,
                'level': 4
            }
        ]
    },
    {
        'position': '충청북도',
        'lat': 36.6356706,
        'lng': 127.4910475,
        'level': 7,
        'positionDetail': [
            {
                'name': '청주시',
                'lat': 36.6376372,
                'lng': 127.4883995,
                'level': 4
            },
            {
                'name': '충주시',
                'lat': 36.9705198,
                'lng': 127.9455175,
                'level': 4
            },
            {
                'name': '제천시',
                'lat': 37.1282661,
                'lng': 128.2179716,
                'level': 4
            },
            {
                'name': '보은군',
                'lat': 36.4881243,
                'lng': 127.7247853,
                'level': 4
            },
            {
                'name': '옥천군',
                'lat': 36.3035711,
                'lng': 127.5735827,
                'level': 4
            },
            {
                'name': '영동군',
                'lat': 36.1762378,
                'lng': 127.7731168,
                'level': 4
            },
            {
                'name': '진천군',
                'lat': 36.8584948,
                'lng': 127.4371328,
                'level': 4
            },
            {
                'name': '음성군',
                'lat': 36.9441413,
                'lng': 127.6850695,
                'level': 4
            },
            {
                'name': '괴산군',
                'lat': 36.8060086,
                'lng': 127.7882855,
                'level': 4
            },
            {
                'name': '단양군',
                'lat': 36.9858971,
                'lng': 128.354498,
                'level': 4
            },
            {
                'name': '증평군',
                'lat': 36.7852379,
                'lng': 127.5942933,
                'level': 4
            }
        ]
    },
    {
        'position': '전라남도',
        'lat': 34.8194009,
        'lng': 126.8930031,
        'level': 7,
        'positionDetail': [
            {
                'name': '목포시',
                'lat': 34.8118056,
                'lng': 126.3922,
                'level': 4
            },
            {
                'name': '여수시',
                'lat': 34.7603731,
                'lng': 127.6622223,
                'level': 4
            },
            {
                'name': '순천시',
                'lat': 34.9506379,
                'lng': 127.4872024,
                'level': 4
            },
            {
                'name': '나주시',
                'lat': 35.0152115,
                'lng': 126.7190493,
                'level': 4
            },
            {
                'name': '광양시',
                'lat': 34.9437133,
                'lng': 127.7004322,
                'level': 4
            },
            {
                'name': '담양군',
                'lat': 35.326876,
                'lng': 126.9880757,
                'level': 4
            },
            {
                'name': '장성군',
                'lat': 35.3044823,
                'lng': 126.7790333,
                'level': 4
            },
            {
                'name': '곡성군',
                'lat': 35.2829362,
                'lng': 127.281789,
                'level': 4
            },
            {
                'name': '구례군',
                'lat': 35.2067996,
                'lng': 127.4912873,
                'level': 4
            },
            {
                'name': '고흥군',
                'lat': 34.601279,
                'lng': 127.289037,
                'level': 4
            },
            {
                'name': '보성군',
                'lat': 34.7615293,
                'lng': 127.0805837,
                'level': 4
            },
            {
                'name': '화순군',
                'lat': 35.066846,
                'lng': 127.0004057,
                'level': 4
            },
            {
                'name': '장흥군',
                'lat': 34.6854474,
                'lng': 126.9056472,
                'level': 4
            },
            {
                'name': '강진군',
                'lat': 34.630941,
                'lng': 126.7818165,
                'level': 4
            },
            {
                'name': '해남군',
                'lat': 34.5663174,
                'lng': 126.600502,
                'level': 4
            },
            {
                'name': '영암군',
                'lat': 34.797655,
                'lng': 126.6845885,
                'level': 4
            },
            {
                'name': '무안군',
                'lat': 34.9919614,
                'lng': 126.4643019,
                'level': 4
            },
            {
                'name': '함평군',
                'lat': 35.0650242,
                'lng': 126.5243435,
                'level': 4
            },
            {
                'name': '영광군',
                'lat': 35.2776162,
                'lng': 126.503007,
                'level': 4
            },
            {
                'name': '장성군',
                'lat': 35.3044823,
                'lng': 126.7790333,
                'level': 4
            },
            {
                'name': '완도군',
                'lat': 34.3367384,
                'lng': 126.7335958,
                'level': 4
            },
            {
                'name': '진도군',
                'lat': 34.4858679,
                'lng': 126.2568435,
                'level': 4
            },
            {
                'name': '신안군',
                'lat': 34.8322894,
                'lng': 126.3203139,
                'level': 4
            }
        ]
    },
    {
        'position': '전북특별자치도',
        'lat': 35.7167057,
        'lng': 127.1441858,
        'level': 7,
        'positionDetail': [
            {
                'name': '전주시',
                'lat': 35.8242234,
                'lng': 127.1488005,
                'level': 4
            },
            {
                'name': '익산시',
                'lat': 35.9401352,
                'lng': 126.9545683,
                'level': 4
            },
            {
                'name': '군산시',
                'lat': 35.9785909,
                'lng': 126.7360111,
                'level': 4
            },
            {
                'name': '정읍시',
                'lat': 35.571629,
                'lng': 126.8506461,
                'level': 4
            },
            {
                'name': '남원시',
                'lat': 35.4125962,
                'lng': 127.382377,
                'level': 4
            },
            {
                'name': '김제시',
                'lat': 35.8032633,
                'lng': 126.8804864,
                'level': 4
            },
            {
                'name': '완주군',
                'lat': 35.8242745,
                'lng': 127.1573275,
                'level': 4
            },
            {
                'name': '진안군',
                'lat': 35.8020952,
                'lng': 127.4317324,
                'level': 4
            },
            {
                'name': '무주군',
                'lat': 36.0068361,
                'lng': 127.6623865,
                'level': 4
            },
            {
                'name': '장수군',
                'lat': 35.6638285,
                'lng': 127.509206,
                'level': 4
            },
            {
                'name': '임실군',
                'lat': 35.6145364,
                'lng': 127.2790242,
                'level': 4
            },
            {
                'name': '순창군',
                'lat': 35.3558355,
                'lng': 127.144947,
                'level': 4
            },
            {
                'name': '고창군',
                'lat': 35.4369941,
                'lng': 126.5119623,
                'level': 4
            },
            {
                'name': '부안군',
                'lat': 35.7347769,
                'lng': 126.7943635,
                'level': 4
            }
        ]
    },

    {
        'position': '경상남도',
        'lat': 35.2380353,
        'lng': 128.6926249,
        'level': 7,
        'positionDetail': [
            {
                'name': '창원시',
                'lat': 35.2321592,
                'lng': 128.6811107,
                'level': 4
            },
            {
                'name': '진주시',
                'lat': 35.1800254,
                'lng': 128.1076211,
                'level': 4
            },
            {
                'name': '통영시',
                'lat': 34.857366,
                'lng': 128.4285101,
                'level': 4
            },
            {
                'name': '사천시',
                'lat': 35.0141993,
                'lng': 128.0703354,
                'level': 4
            },
            {
                'name': '김해시',
                'lat': 35.2282755,
                'lng': 128.8920911,
                'level': 4
            },
            {
                'name': '밀양시',
                'lat': 35.4907006,
                'lng': 128.748679,
                'level': 4
            },
            {
                'name': '거제시',
                'lat': 34.8802758,
                'lng': 128.6283893,
                'level': 4
            },
            {
                'name': '양산시',
                'lat': 35.3386741,
                'lng': 129.0328735,
                'level': 4
            },
            {
                'name': '의령군',
                'lat': 35.3190106,
                'lng': 128.2896293,
                'level': 4
            },
            {
                'name': '함안군',
                'lat': 35.2791082,
                'lng': 128.4200546,
                'level': 4
            },
            {
                'name': '창녕군',
                'lat': 35.5437295,
                'lng': 128.4966594,
                'level': 4
            },
            {
                'name': '고성군',
                'lat': 34.9769072,
                'lng': 128.3163481,
                'level': 4
            },
            {
                'name': '남해군',
                'lat': 34.8335729,
                'lng': 127.8747393,
                'level': 4
            },
            {
                'name': '하동군',
                'lat': 35.0615527,
                'lng': 127.7669185,
                'level': 4
            },
            {
                'name': '산청군',
                'lat': 35.4138241,
                'lng': 127.8720118,
                'level': 4
            },
            {
                'name': '함양군',
                'lat': 35.535902,
                'lng': 127.7368122,
                'level': 4
            },
            {
                'name': '거창군',
                'lat': 35.6865161,
                'lng': 127.914219,
                'level': 4
            },
            {
                'name': '합천군',
                'lat': 35.5653565,
                'lng': 128.1652819,
                'level': 4
            },
            {
                'name': '마산합포구',
                'lat': 35.143317,
                'lng': 128.5720035,
                'level': 4
            },
            {
                'name': '마산회원구',
                'lat': 35.2194002,
                'lng': 128.5817468,
                'level': 4
            },
            {
                'name': '진해구',
                'lat': 35.1410889,
                'lng': 128.662673,
                'level': 4
            }
        ]
    },
    {
        'position': '경상북도',
        'lat': 36.575994,
        'lng': 128.5052976,
        'level': 7,
        'positionDetail': [
            {
                'name': '포항시',
                'lat': 36.0203517,
                'lng': 129.3657892,
                'level': 4
            },
            {
                'name': '경주시',
                'lat': 35.8561711,
                'lng': 129.2247471,
                'level': 4
            },
            {
                'name': '김천시',
                'lat': 36.1332253,
                'lng': 128.3512211,
                'level': 4
            },
            {
                'name': '안동시',
                'lat': 36.5685053,
                'lng': 128.7298789,
                'level': 4
            },
            {
                'name': '구미시',
                'lat': 36.1239291,
                'lng': 128.3444649,
                'level': 4
            },
            {
                'name': '영주시',
                'lat': 36.8270374,
                'lng': 128.6278208,
                'level': 4
            },
            {
                'name': '영천시',
                'lat': 35.9770316,
                'lng': 128.9488787,
                'level': 4
            },
            {
                'name': '상주시',
                'lat': 36.4126322,
                'lng': 128.1554914,
                'level': 4
            },
            {
                'name': '문경시',
                'lat': 36.5933157,
                'lng': 128.189159,
                'level': 4
            },
            {
                'name': '경산시',
                'lat': 35.8235384,
                'lng': 128.7359949,
                'level': 4
            },
            {
                'name': '군위군',
                'lat': 36.2389514,
                'lng': 128.5721658,
                'level': 4
            },
            {
                'name': '의성군',
                'lat': 36.3505309,
                'lng': 128.7113254,
                'level': 4
            },
            {
                'name': '청송군',
                'lat': 36.4330709,
                'lng': 129.0449691,
                'level': 4
            },
            {
                'name': '영양군',
                'lat': 36.6697871,
                'lng': 129.1255372,
                'level': 4
            },
            {
                'name': '영덕군',
                'lat': 36.4183424,
                'lng': 129.3569498,
                'level': 4
            },
            {
                'name': '청도군',
                'lat': 35.6488732,
                'lng': 128.7172379,
                'level': 4
            },
            {
                'name': '고령군',
                'lat': 35.7255329,
                'lng': 128.2453649,
                'level': 4
            },
            {
                'name': '성주군',
                'lat': 35.9149069,
                'lng': 128.2904985,
                'level': 4
            },
            {
                'name': '칠곡군',
                'lat': 36.0497091,
                'lng': 128.4007193,
                'level': 4
            },
            {
                'name': '예천군',
                'lat': 36.6485361,
                'lng': 128.4431619,
                'level': 4
            },
            {
                'name': '봉화군',
                'lat': 36.8919365,
                'lng': 128.7341097,
                'level': 4
            },
            {
                'name': '울진군',
                'lat': 36.9947175,
                'lng': 129.3954482,
                'level': 4
            },
            {
                'name': '울릉군',
                'lat': 37.4816251,
                'lng': 130.898307,
                'level': 4
            }
        ]
    },
    {
        'position': '세종특별자치시',
        'lat': 36.480132,
        'lng': 127.289021,
        'level': 7,
        'positionDetail': [
            {
                'name': '세종특별자치시',
                'lat': 36.480132,
                'lng': 127.289021,
                'level': 4
            }
        ]
    },
    {
        'position': '제주특별자치도',
        'lat': 33.4890118,
        'lng': 126.4983023,
        'level': 7,
        'positionDetail': [
            {
                'name': '제주시',
                'lat': 33.5007708,
                'lng': 126.5217564,
                'level': 4
            },
            {
                'name': '서귀포시',
                'lat': 33.2508368,
                'lng': 126.5607291,
                'level': 4
            }
        ]
    }
]

centers.forEach(city => {
  city.positionDetail.sort((a, b) => a.name.localeCompare(b.name));
});

centers.sort((a, b) => a.position.localeCompare(b.position));
  return { centers }
})
